InformationRegisters/ИА_ПраваЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПраваЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПраваГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_ПраваГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ПраваГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ПраваПривилегированный/Ext/Module.bsl
Функция ЗначениеПрава(Пользователь, ЭлементПраво) Экспорт
    Если ТипЗнч(ЭлементПраво) = Тип("Строка") Тогда
        Право = ПланыВидовХарактеристик.ИА_ПраваПользователей[ЭлементПраво];
    Иначе
        Право = ЭлементПраво;
    КонецЕсли; 
    
    Отбор = Новый Массив;
    Если ЗначениеЗаполнено(Пользователь) Тогда
        Отбор.Добавить(Пользователь);	
        Ц = Пользователь;
        Пока ЗначениеЗаполнено(Ц.Родитель) Цикл        
            Отбор.Добавить(Ц.Родитель);
            Ц = Ц.Родитель;
        КонецЦикла; 
        Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Т.Ссылка,
        |   Т.Ссылка.Порядок КАК Порядок
        |ИЗ
        |   Справочник.ИА_ПраваГруппыПользователей.Состав КАК Т
        |ГДЕ
        |   Т.Пользователь В (&МассивПользователей)
        |   И НЕ Т.Ссылка.ПометкаУдаления
        |   И Т.Ссылка <> ЗНАЧЕНИЕ(Справочник.ИА_ПраваГруппыПользователей.ВсеПользователи)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   ЗНАЧЕНИЕ(Справочник.ИА_ПраваГруппыПользователей.ВсеПользователи),
        |   999999999
        |
        |УПОРЯДОЧИТЬ ПО
        |   Порядок");
        Запрос.УстановитьПараметр("МассивПользователей", Отбор);
        Выборка = Запрос.Выполнить().Выбрать();
        Пока Выборка.Следующий() Цикл
            Отбор.Добавить(Выборка.Ссылка);
        КонецЦикла;
    КонецЕсли; 
     
    Контекст = Новый Структура("Пользователь, Право, Отбор"
    , Пользователь, Право, Отбор);
    ИА_ПраваСПереопределяемый.ДополнитьОтборПоПользователю(Контекст);
    
    Результат = ЗначениеПраваВнутр(Отбор, Право);
    
    Результат = Право.ТипЗначения.ПривестиЗначение(Результат); // т.к. м.б. "неопределено"
    
    Контекст = Новый Структура("Пользователь, Право, Отбор, Результат"
    , Пользователь, Право, Отбор, Результат);
    ИА_ПраваСПереопределяемый.ПослеПолученияЗначенияПрава(Контекст);
    
    Возврат Контекст.Результат;
КонецФункции

Функция ЗначениеПраваВнутр(Отбор, Право)
    // Пользователь м.б. "массивом", в таком случае порядок в этом массиве считается порядком поиска права:
    // более ранний в массиве имеет больший приоритет
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Право = ПланыВидовХарактеристик.ИА_ПраваПользователей.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Результат = Право.ЗначениеПоУмолчанию;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Т.Пользователь,
    |   Т.Право,
    |   Т.Значение
    |ИЗ
    |   РегистрСведений.ИА_ПраваЗначения КАК Т
    |ГДЕ
    |   Т.Пользователь В(&Массив)
    |   И Т.Право = &Право";
    Запрос.УстановитьПараметр("Массив",   Отбор);
    Запрос.УстановитьПараметр("Право",    Право);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        Мин = Отбор.Количество() + 1;
        Пока Выборка.Следующий() Цикл
            Индекс = Отбор.Найти(Выборка.Пользователь);
            Если Индекс < Мин Тогда
                Мин = Индекс;
                Результат = Выборка.Значение;                
            КонецЕсли; 
        КонецЦикла;
    КонецЕсли; 
    Возврат Результат;
КонецФункции
